[{"_key":"Ansoo Lake","Desc":"Ansoo Lake is situated in Kaghan Valley of Pakistan. It is located near in the Himalayan range at the altitude of 4,245 meters (13,927 ft). This lake is considered to be one of the most beautiful lakes of the world. The name \"Ansoo\" comes from its tear-like shape. The lake also resembles a human eye with a central ice island resembling the iris and a ridge resembling an eyebrow, which becomes even more prominent when ice melts on the \"eyebrow\" during the summer. The lake is said to have been discovered in 1993 by Pakistan Air Force pilots who were flying low in the area.\r\n(Photo Credit: pakfocus.com )","category":"Lake","district":"Khyber Pakhtunkhwa","latitude":"34.8141186","longitude":"73.67642783"},{"_key":"Astola Island","Desc":"Astola Island, also known as Jezira Haft Talar Satadip or 'Island of the Seven Hills', is a small uninhabited Pakistani island in the Arabian Sea approximately 25 km (16 mi) south of the nearest part of the coast and 39 km (24 mi) southeast of the fishing port of Pasni. Astola is Pakistan's largest offshore island at approximately 6.7 km (4.2 mi) long with a maximum width of 2.3 km (1.4 mi) and an area of approximately 6.7 km2 (2.6 sq mi). The highest point is 246 ft (75 m) above sea level. \r\n (Photo Credit: Buzzpk )","category":"Island","district":"Balochistan","latitude":"25.1223206","longitude":"63.84794782"},{"_key":"Attabad Lake","Desc":"Attabad Lake is a lake in the Gojal Valley of northern Pakistan created in January 2010 by a landslide dam.The lake was formed due to a massive landslide at Attabad village in Gilgit-Baltistan, 9 miles (14 km) upstream (east) of Karimabad that occurred on January 4, 2010.It reached 13 miles (21 km) long and over 100 metres (330 ft) in depth by the first week of June 2010 when it began flowing over the landslide dam, completely submerging lower Shishkat and partly flooding Gulmit .\r\n(Photo Credit: HumansOfHunza | Twitter )","category":"Lake","district":"Gilgit−Baltistan","latitude":"36.3458274","longitude":"74.86543579"},{"_key":"Badshahi Mosque","Desc":"The Badshahi Mosque is a Mughal-era congregational mosque in Lahore, capital of the Pakistani province of Punjab, Pakistan. The mosque is located west of Lahore Fort along the outskirts of the Walled City of Lahore, and is widely considered to be one of Lahore's most iconic landmarks.","category":"Mosque","district":"Punjab","latitude":"31.588126","longitude":"74.30932246"},{"_key":"Baltoro Glacier","Desc":"The Baltoro Glacier, at 63 km (39 mi) in length, is one of the longest glaciers outside the Polar Regions. It is located in Baltistan, in the Gilgit-Baltistan region of Pakistan, and runs through part of the Karakoram mountain range.\r\n (Photo Credit:aishanoor.deviantart.com )","category":"Mountainous","district":"Gilgit−Baltistan","latitude":"35.7106418","longitude":"76.55314235"},{"_key":"Bhurban","Desc":"Bhurban is a small town resort and hill station situated between Murree and Kashmir Road in Punjab province of Pakistan. It is just 11 km away from Murree and 68.8 km away from Islamabad. It is one of the best hill stations with a unique variety of species to visit with friends and families.","category":"Hill Station","district":"Punjab","latitude":"33.9550872","longitude":"73.4518727"},{"_key":"Bruti waterfall Islamabad","Desc":"Bruti waterfall is 3 km from Bari Imam Islamabad and 0.5 hours drive from Islamabad center. It is a 10-foot waterfall and swimming pond that is a very good picnic place for families.","category":"Waterfall","district":"Islamabad","latitude":"33.7742831","longitude":"73.1139125"},{"_key":"Concordia","Desc":"Amongst the tallest 14 mountain peaks of the world that are above 8000 meters, Pakistan proudly bears five. And, of those, four peaks can easily be seen from the Concordia, a camp site at the elevation of 4600 meters. The tallest and most magical of the four is K-2 (8611m), this is the very reason why Concordia has been labeled as \"The Mountaineer's Paradise.  (Photo Credit : FireElf.com )","category":"Mountainous","district":"Gilgit−Baltistan","latitude":"35.7416218","longitude":"76.5118925"},{"_key":"Deosai National Park","Desc":"Referred to as the ‘land of giants’, this beauty is situated in the Astore District of Gilgit-Baltistan. It is on the boundary of Karakorum and western Himalayas. It is home to various kinds of flowers, countless species of animal, including the brown bear and snow leopard. It is the highest plateau in the world. So if you wish to see wildlife in Pakistan, this place cannot be missed. ( Photo Credit: Kamran Saleem Photography )","category":"National Park","district":"Gilgit−Baltistan","latitude":"34.9565886","longitude":"75.47983135"},{"_key":"Derawar Fort","Desc":"This is a magnificent structure in the middle of the Cholistan Desert. It is fortress of monumental proportions, Derawar’s 40 stunning bastions rise from the desert in a striking square formation. Combined, the fort’s walls form a circumference of some 1,500m and stand some 30m high.\r\n  (Photo Credit: Sami's Photography | gettyimages )","category":"Fort","district":"Punjab","latitude":"28.76800705","longitude":"71.33424735"},{"_key":"Dhanni Waterfall","Desc":"Dhanni waterfall is located in Panjkot village, Muzaffarabad district, of Azad Kashmir, Pakistan. The estimate terrain elevation above sea level is 1517 meters. Area is located at the banks of the Jhelum and the Neelum rivers, and is very hilly. The city of Muzaffarabad serves as capital to Azad Kashmir.(Photo Credit: AMG Prospective )","category":"Waterfall","district":"Azad Kashmir","latitude":"34.4241","longitude":"73.6911"},{"_key":"Emperor's Mosque","Desc":"The Emperor's Mosque ( Badshahi Mosque)  in Lahore was commissioned by the sixth Mughal Emperor Aurangzeb. Constructed between 1671 and 1673. It is the second largest mosque in Pakistan and the seventh largest mosque in the world. Aurangzeb's mosque's architectural plan is similar to that of his father, Shah Jehan, the Jama Masjid in Delhi; though it is much larger. The courtyard which spreads over 276,000 square feet, can accommodate one hundred thousand worshippers; ten thousand can be accommodated inside the mosque. The Mosque is one of the most famous Mughal structures.\r\n (Photo Credit: hello.com.pk )","category":"Mosque","district":"Punjab","latitude":"31.588126","longitude":"74.30932246"},{"_key":"Fairy Meadows","Desc":"Fairy Meadows, named by German climbers (German Märchenwiese, ″fairy tale meadows″) is grassland near one of the base camp sites of the Nanga Parbat, located in Diamer District, Gilgit-Baltistan. At an altitude of about 3,300 meters above the sea level, it serves as the launching point for trekkers summiting on the Rakhiot face of the Nanga Parbat. \r\n (Photo Credit: fairymeadowscottage.com )","category":"National Park","district":"Gilgit−Baltistan","latitude":"35.3872034","longitude":"74.57892916"},{"_key":"Faisal Mosque","Desc":"The Faisal Mosque is a mosque located in Islamabad, Pakistan. It is the sixth-largest mosque in the world and the largest within South Asia, located on the foothills of Margalla Hills in Pakistan's capital city of Islamabad.","category":"Mosque","district":"Islamabad","latitude":"33.7297492","longitude":"73.03736"},{"_key":"Farphu Waterfall","Desc":"Farphu Waterfall in Bagrot Valley of Gilgit Baltistan is probably the most beautiful and tallest / highest waterfall in all of Pakistan at 350 feet. Getting there is the difficult part. You have to drive to Skardu 640 km and 1.5 hours from Islamabad, for 2 hours and finally walk to Farphu Waterfall a total of 10 hours.","category":"Waterfall","district":"Gilgit−Baltistan","latitude":"35.9995","longitude":"75.9999"},{"_key":"Gawadar","Desc":"Gwadar is a port city on the southwestern coast of Pakistan's Balochistan province where the Arabian Sea meets the Persian Gulf just outside the Strait of Hormuz near key shipping routes in and out of the Persian Gulf. It is about 700 km from Karachi and 120 km from the Iranian border.\r\n(Photo Credit: defence.pk | by Muhammad Omar )","category":"Coastal","district":"Balochistan","latitude":"25.154342","longitude":"62.0499838"},{"_key":"Gojal Valley","Desc":"The Gojal Valley borders China and Afghanistan, with its border meeting the Chinese border at Khunjerab — 15,397 feet above sea level — and remains covered with snow all year long. The Karakoram Highway which connects Pakistan to China also passes through Gojal Valley and enters China at Khunjerab.\r\n(Photo Credit: S.M.Bukhari's Photography )","category":"Valley","district":"Gilgit−Baltistan","latitude":"36.6176353","longitude":"74.8632045"},{"_key":"Gorakh Hill","Desc":"Gorakh is a Hill Station of Sindh, Pakistan. It is situated at an elevation of 5,688 ft (1,734 m) in the Kirthar Mountains. Gorakh Hill Station is situated on one of the highest plateaus of Sindh, spread over 2,500 acres (10 km2) of land. It is very attractive to nature-lovers owing to its temperate weather and beautiful surroundings. Gorakh's elevation gives it a special climate, with sub-zero temperatures during winter and generally below 20 °C in summer, with about 120 mm of average annual rainfall. (Photo Credit: Adil Nisar | Pikore )","category":"Hill Station","district":"Sindh","latitude":"26.8611674","longitude":"67.1511368"},{"_key":"Gulpur Mahuli waterfalls","Desc":"Gulpur Mahuli waterfall is a 110 km and a 3.5 hours drive from Islamabad. You can take two roads to get here; the first road to Gulpur Mahuli waterfall is from Islamabad – Kahuta –Sehnsa –Gulpur (Kotli Azad Kashmir); the second is through Rawat – Kallar Syedan – Dadyal –","category":"Waterfall","district":"Azad Kashmir","latitude":"33.46410685","longitude":"73.86825122"},{"_key":"Hingol National Park","Desc":"Hingol national park stretches out to approximately 1,650 km and is one of the largest national parks of Pakistan.It lies on the Makran coast in Balochistan and is situated about 190 km from Karachi.\r\nThe national park entails topographical features varying from barren forests in the north to cooler regions in the west that have regular rainfall and are home to different plants and animals. Also Mud volcanoes can be found in the area. (Photo Credit: pakistantoursguide.pk )","category":"National Park","district":"Balochistan","latitude":"25.5064168","longitude":"65.530701"},{"_key":"Hunza Valley","Desc":"The Hunza Valley is a mountainous valley in the Gilgit–Baltistan region; it was formerly a princely state. The Hunza valley is situated north/west of the Hunza River, at an elevation of around 2,500 metres. The Valley has three Regions – Upper Hunza (Gojal); Center Hunza and Lower Hunza.\r\n( Photo Credit: Blogs – Tribune.com.pk | By Parhlo )","category":"Valley","district":"Gilgit−Baltistan","latitude":"36.3167","longitude":"74.65"},{"_key":"Indus Kohistan","Desc":"Rounding the western end of the Himalaya at Nanga Parbat (8125m), the Indus River cuts a gorge so deep that some parts see only a few hours of sunlight a day. The Highway traveller is surrounded by this fractured, crumbling landscape with barely a blade of grass visible – magnificent and ominous .It’s a landscape in motion; the sheer rock walls are being ripped apart by powerful waterfalls carving out yawning canyons, and rocks lie scattered across the road.\r\n(Photo Credit: AMG Prospective)","category":"Mountainous","district":"Khyber Pakhtunkhwa","latitude":"35.5074167","longitude":"73.2877772"},{"_key":"Jahaz Banda Kumrat Valley","Desc":"Jahaz Banda Waterfall is the mightiest of the several waterfalls in Kumrat Valley in Sherigan, near Dir. Jahaz Banda waterfall is 380 Kms and 10 hours drive from Islamabad, so leave early.","category":"Waterfall","district":"Khyber Pakhtunkhwa","latitude":"35.5638686","longitude":"72.1941226"},{"_key":"Kalam Valley","Desc":"Kalam is a cool heaven for tourists, which is located at distance of 99 km from mingora in the northern upper reaches of Swat valley along the bank of Suvastu River in Khyber Pakhtunkhwa province of Pakistan. It is a spacious sub-valley of Swat, at an elevation of about 2,000 meters (6,600 feet) above sea level.  From Matiltan some snow-capped mountains are visible including Mount Falaksar 5,918 meters (19,416 feet), and another unnamed peak 6,096 meters (20,000 feet) high.\r\n  (Photo Credit: AMG Perspective )","category":"Valley","district":"Khyber Pakhtunkhwa","latitude":"35.4902","longitude":"72.5796"},{"_key":"Kalash","Desc":"The Kalasha Valleys are valleys in Chitral District in northern Pakistan. The valleys are surrounded by the Hindu Kush mountain range. The inhabitants of the valley are the Kalash people, who have a unique culture, language and follow a form of ancient Hinduism. The Kalasha Valleys are a source of attraction for Pakistani as well as International tourists.\r\n (Photo Credit: Imran Schah | Flickr )","category":"Valley","district":"Khyber Pakhtunkhwa","latitude":"35.6838","longitude":"71.6554"},{"_key":"Kanhatti Gardens","Desc":"have two or three clear water ponds with 15-foot height waterfalls. Kanhatti Gardens","category":"Waterfall","district":"Punjab","latitude":"32.6774124","longitude":"72.2474823"},{"_key":"Karambar Lake","Desc":"Karambar Lake (also known as Qurumbar Lake) is a high altitude lake located in Ishkomen, a Tehsil of District Ghizer in Gilgit–Baltistan. It is the 31st highest lake in the world and 2nd highest in Pakistan at a height of 14,121 feet (4,304 m) and one of the highest biologically active lakes on earth.\r\n (Photo Credit : explorebeautyofpakistan.com )","category":"Lake","district":"Khyber Pakhtunkhwa","latitude":"36.8784107","longitude":"73.70117513"},{"_key":"Katasraj temple","Desc":"Katasraj Mandir (Punjabi, Urdu: کٹاس راج مندر‎) is a Hindu temple complex situated in Katas village near Choa Saidanshah in the Chakwal district of Punjab in Pakistan. Dedicated to Shiva, the temple has, according to Hindu legend, existed since the days of Mahābhārata and the Pandava brothers spent a substantial part of their exile at the site and later Krishna himself laid the foundation of the temple. The Pakistan Government is considering nominating the temple complex for World Heritage Site status. (Photo Credit: trekkso.com )","category":"Temple","district":"Punjab","latitude":"32.7239451","longitude":"72.9516404"},{"_key":"Khewra Salt Mine","Desc":"The Khewra Salt Mine is located in Khewra, north of Pind Dadan Khan of Jhelum District, Punjab Region, Pakistan, which rises from the Indo-Gangetic Plain. It is Pakistan's largest and oldest salt mine and the world's second largest source of salt. It is a major tourist attraction, drawing up to 250,000 visitors a year. Its history dates back to its discovery by Alexander's troops in 320 B.Th. main tunnel at ground level was developed by Dr. H. Warth, a mining engineer, in 1872 during British rule.\r\n(Photo Credit: snackablenews.com )","category":"Mine","district":"Punjab","latitude":"32.6465569","longitude":"73.0062054"},{"_key":"Kiwai Kaghan","Desc":"Kiwai is a small waterfall and picnic spot on the way to Naran. It is so popular in traveling families; therefore I have included it in my list. Kiwai waterfall and picnic spot is 190 km and 5.5 hours from Islamabad.","category":"Waterfall","district":"Khyber Pakhtunkhwa","latitude":"34.77916173","longitude":"73.52379989"},{"_key":"Lahore Fort","Desc":"The Lahore Fort is a citadel in the city of Lahore, Punjab, Pakistan. The fortress is located at the northern end of walled city Lahore, and spreads over an area greater than 20 hectares. It contains 21 notable monuments, some of which date to the era of Emperor Akbar.","category":"Fort","district":"Punjab","latitude":"31.58803305","longitude":"74.31495649"},{"_key":"Lake Saif-ul-Malook","Desc":"This beauty is located at the northern end of Kaghan Valley. It is in the north-east of Mansehra Division of the Khyber-Pakhtunkhwa province. Not only the mountains surrounding it make the place beautiful, but its reflection in the lake is definitely breathtaking.\r\n (Photo Credit: Chsahi | Twitter )","category":"Lake","district":"Khyber Pakhtunkhwa","latitude":"34.8818168","longitude":"73.6957232"},{"_key":"Lasbela Beach","Desc":"Lasbela is a coastal district of Balochistan, catering the Hashmi beach with shallow sand and clear waters.\r\n ( Photo Credit: deserted beaches | Pinterest )","category":"Coastal","district":"Balochistan","latitude":"25.1186","longitude":"66.7267"},{"_key":"Mahodand Waterfall","Desc":"One hour short of Mahodand lake is a beautiful waterfall that drops down in a huge shower that covers the vicinity of the waterfall in droplets. is one of the Highest and Mighty waterfalls in Swat as well as Pakistan. The height of the Waterfall is more than 300ft.","category":"Waterfall","district":"Khyber Pakhtunkhwa","latitude":"35.7139","longitude":"72.651"},{"_key":"Malam Jabba","Desc":"Malam Jabba is home to the only ski resort in Pakistan. The area also contains two Buddhist stupas and six monasteries that are scattered around the resort. The presence of the monuments at such a height indicates that the area has been inhabited for over 2000 years. Two trekking trails are located near the Malam Jabba resort. \r\n (Photo Credit: M.Sajid Ishaq )","category":"Hill Station","district":"Khyber Pakhtunkhwa","latitude":"34.7999","longitude":"72.5722"},{"_key":"Manthoka Waterfall","Desc":"Manthoka is 600 Kms and 15.5 hours from Islamabad. You'd have to stop at Skardu for the night.","category":"Waterfall","district":"Gilgit-Baltistan","latitude":"35.066229","longitude":"75.9947968"},{"_key":"Masjid Wazir Khan","Desc":"The Wazir Khan Mosque is a 17th-century mosque located in the city of Lahore, capital of the Pakistani province of Punjab. The mosque was commissioned during the reign of the Mughal Emperor Shah Jahan as a part of an ensemble of buildings that also included the nearby Shahi Hammam baths","category":"Mosque","district":"Punjab","latitude":"31.5833","longitude":"74.3236"},{"_key":"Matiltan","Desc":"Matiltan is a picturesque spot comes after Usho and located at a distance of about 11 km away from Kalam. It is famous for huge glaciers, thick forests and lofty mountain peaks. It is accessible through a non metalled road from Kalam by a four-wheel drive vehicle.  (Photo Credit: AMG Perspective )","category":"Valley","district":"Khyber Pakhtunkhwa","latitude":"35.5418","longitude":"72.6595"},{"_key":"Minar-e-Pakistan","Desc":"Minar-e-Pakistan is a national monument located in Lahore, Pakistan. The tower was built between 1960 and 1968 on the site where the All-India Muslim League passed the Lahore Resolution on 23 March 1940 - the first official call for a separate and independent homeland for the Muslims of British India, as espoused by the two-nation theory.","category":"Monument","district":"Punjab","latitude":"31.5925","longitude":"74.3095"},{"_key":"Mohatta Palace","Desc":"The Mohatta Palace is a museum located in Karachi, Sindh, Pakistan. Designed by Agha Ahmed Hussain, the palace was built in 1927 in the posh seaside locale of Clifton as the summer home of Shivratan Mohatta, a Hindu Marwari businessman from what is now the modern-day Indian state of Rajasthan.","category":"Museum","district":"Sindh","latitude":"24.8142","longitude":"67.033"},{"_key":"Mohenjo-daro","Desc":"Mohenjo-daro. Meaning Mound of the Dead Men is an archeological site in the province of Sindh, Pakistan. Built around 2500 BCE, it was one of the largest settlements of the ancient Indus Valley Civilization, and one of the world's earliest major urban settlements, contemporaneous with the civilizations of ancient Egypt, Mesopotamia, Minoa (Crete), and Norte Chico. Mohenjo-daro was abandoned in the 19th century BCE as the Indus Valley Civilization declined, and the site was not rediscovered until the 1920s. Significant excavation has since been conducted at the site of the city, which was designated a UNESCO World Heritage Site in 1980.\r\n(Photo Credit: SM Rafiq Photography | gettyimages )","category":"Valley","district":"Sindh","latitude":"27.3243","longitude":"68.1357"},{"_key":"Moola Chotok","Desc":"Chotak waterfall and Oasis in Moola, Khuzdar is a wonderland of crystal clear water, palm trees, and narrow waterways. It is 1250 km and 15 hours drive from Islamabad.","category":"Waterfall","district":"Balochistan","latitude":"27.7572","longitude":"66.6405599"},{"_key":"Naltar lake","Desc":"Naltar Lake is named as Seven Colours Lake (satrangi jheel). Naltar is a valley near Gilgit , Hunza and Nomal, Gilgit Baltistan in the Gilgit–Baltistan province of Pakistan. Naltar is 40 km (25 mi) from Gilgit and can be reached by jeeps. It's a forested (pine) village known for its wildlife and magnificent mountain scenery. \r\n  ( Photo Credit: S.M.Bukhari's Photography )","category":"Lake","district":"Gilgit-Baltistan","latitude":"36.2397","longitude":"74.0821"},{"_key":"Narh waterfall","Desc":"Narh Waterfall is in the Kahuta region of Pakistan and you have to follow the Kahuta Panjaar road to get there. Turn left from the signboard that says and climb into the mountains.","category":"Waterfall","district":"Punjab","latitude":"33.683958","longitude":"73.5289869"},{"_key":"Neela Sandh Waterfall Kotli Sattian","Desc":"Neela Sandh Waterfall and the mini pond is located near Mouri Syedan on the Lehtrar Kotli Syedan Road. It takes 1.5 hours to drive 50 km to Neela Sandh from Islamabad.","category":"Waterfall","district":"Punjab","latitude":"33.66149","longitude":"73.384519"},{"_key":"Neelam Valley","Desc":"Neelam Valley is a 144 km long bow-shaped valley in Azad Kashmir Region. The Valley is situated at the North-East of Muzaffarabad. Running through the Lesser Himalaya, the Neelam River valley has excellent scenic beauty, panoramic views; towering hills on both sides of the noisy Neelum River, lush green forests, enchanting streams and attractive surroundings make the valley a dream come true.\r\n  (Photo Credit: Imran Akram's Photography)","category":"Valley","district":"Azad Kashmir","latitude":"34.5985","longitude":"73.9073"},{"_key":"Noori de Than Waterfall Jabri","Desc":"Noori waterfall of Jabri village Haripur is short for Noorean de Than. Jabri village is closer to  than Haripur. Islamabad Pir Sohawa","category":"Waterfall","district":"Khyber Pakhtunkhwa","latitude":"33.893504","longitude":"73.117348"},{"_key":"Pakistan Air Force Museum","Desc":"Pakistan Air Force Museum Faisal is an Air Force museum and park situated near Karsaz Flyover on Shahrah-e-Faisal in Karachi, Sindh, Pakistan. A majority of the aircraft, weapons and radar are displayed outside in the park but the main museum features all major fighter aircraft that have been used by the Pakistan Air Force.","category":"Museum","district":"Sindh","latitude":"24.8709","longitude":"67.0961"},{"_key":"Pakistan Monument","Desc":"The Pakistan Monument was inaugurated in Islamabad on 23 March 2007 as a national monument embodying the country's history, and is in effect rich with significant cultural references. For its design, architect Arif Masood drew inspiration from the figure of a blossoming flower to represent the four provinces and three territories into which Pakistan is subdivided.","category":"Monument","district":"Islamabad","latitude":"33.6931","longitude":"73.0689"},{"_key":"Panjpeer Rocks","Desc":"Panjpeer is the highest point of the Danoi Ridge in Kotli Sattian/Kahuta. It is called Panjpeer because of a shrine it has at the top. Locals believe this was a place where five saints came and got settled. It is at an altitude of approximately 1800 meters. The area is occupied with mountains, rocks, trees, valleys and fountains making it a perfect tourist spot.\r\n(Photo Credit : mirrorpakistan.com )","category":"Mountainous","district":"Islamabad","latitude":"33.7332","longitude":"73.5325"},{"_key":"Pattan","Desc":"Pattan Kalan is a mountainous area located in the Abbottabad District, and is the largest village in the Galyat/Circle Bakot region. Much of the hilly countryside is covered in trees, including evergreens like pine, walnut, oak, and maple. The highest peak of the Abbottabad District the popular tourist destination Thandiani, is located near Pattan Kalan. \r\n(Photo Credit: AMG Prospective )","category":"Mountainous","district":"Khyber Pakhtunkhwa","latitude":"35.11235","longitude":"73.005843"},{"_key":"Pir Sohawa","Desc":"Pir Sohawa is a rapidly developing tourist resort located 17 kilometers (11 mi) from Islamabad on top of Margalla Hills at an elevation of 3000+ feet. Islamabad is one of the most beautiful capitals of the world, famous for its beauty, decor, fascination, attractiveness. There is a restaurant in the vicinity named Monal. Monal is one of the very few posh restaurants in the world that’s located on such a high altitude.\r\n(Photo Credit: Hafiz Arsalan Zia | Flickr )","category":"Resort","district":"Islamabad","latitude":"33.787","longitude":"73.1084"},{"_key":"Rama Lake","Desc":"Rama Lake is a lake near Astore in Gilgit-Baltistan, Pakistan. It is on the top of the beautiful Astore Valley. This valley is dense forested with large cedar, pine, juniper and fir trees, above the sea level Rama Lake is about 3300 meters and is covered by snow for almost 7-8 months of the year. While during summer this valley become lush green\r\n (Photo Credit: S.M. Bukhari’s Photography)","category":"Lake","district":"Gilgit-Baltistan","latitude":"35.3303","longitude":"74.7856"},{"_key":"Ratti Galli Waterfall","Desc":"Sharda Neelum Valley Azad Kashmir is 8 hours or 250 Kilometers from Islamabad. From Sharda, you need 6 hours more to reach Ratti Gali waterfalls that are close to Ratti Gali Lake.","category":"Waterfall","district":"Azad Kashmir","latitude":"34.8296","longitude":"74.0625"},{"_key":"Rawalakot","Desc":"Rawalakot is one of the most beautiful valleys of KASHMIR which is located 80 km away from Rawalpindi and Islamabad. By Road It takes two and a half hour to Rawalakot which is also famous by the name of \"PEARL VALLEY\" its specialty is natural beauty.\r\n (Photo Credit: miriadna.com )","category":"Valley","district":"Azad Kashmir","latitude":"33.8584","longitude":"73.7654"},{"_key":"Rohtas Fort","Desc":"Rohtas Fort is a 16th-century fortress located near the city of Jhelum in the Pakistani province of Punjab. The fort is one of the largest and most formidable in the subcontinent. Rohtas Fort was never stormed by force, and has survived remarkably intact.","category":"Fort","district":"Punjab","latitude":"32.9645","longitude":"73.5745"},{"_key":"Rush Lake","Desc":"Rush Lake is a high altitude lake located in Gilgit-Baltistan near Rush Pari Peak, at the height of 5098 meters. It is one of the highest alpine lakes in the world.\r\n (Photo Credit : wonderslist.com )","category":"Lake","district":"Gilgit-Baltistan","latitude":"36.1745","longitude":"74.8825"},{"_key":"Sajjikot Waterfall Havelian","Desc":"Sajjikot Waterfalls in Havelian, Pakistan is 145 Kms and 3 hours from Islamabad You have to use the Islamabad Peshawar motorway to get to Hazara Interchange and turn North towards Abbottabad.","category":"Waterfall","district":"Khyber Pakhtunkhwa","latitude":"34.001104","longitude":"73.278766"},{"_key":"Satpara Lake","Desc":"Satpara Lake is basically a natural lake that falls in the vicinity of Skardu in the Gilgit-Baltistan province of Pakistan. This lake is basically one of the primary sources of water that goes to the Skardu Valley. This lake is based 2,626 metres above the sea level which is equivalent to 8,650 feet. This lake spreads over an area spanning 2.5 km-square.\r\n (Photo Credit: Heaven On Earth | Pinterest )","category":"Lake","district":"Gilgit-Baltistan","latitude":"35.2294","longitude":"75.6295"},{"_key":"Shalamar Bagh","Desc":"The Shalimar Gardens, romanized: Shalimar Bagh are a Mughal garden complex located in Lahore, capital of the Pakistani province of Punjab. The gardens date from the period when the Mughal Empire was at its artistic and aesthetic zenith, and are now one of Pakistan's most popular tourist destinations.","category":"National Park","district":"Punjab","latitude":"31.5843","longitude":"74.3828"},{"_key":"Shangrila resort","Desc":"Skardu the central valley of Gilgit-Baltistan, is an epitome of beauty, serenity and wilderness. During the journey, one is greeted with several streams, springs, and the hospitality of the local people.After crossing the old wooden bridge built over the River Indus, one reaches Shangrila, a paradise on earth for tourists. It is a famous tourist spot in Skardu, Restaurant in Shangrila rest house is highlight of this place, which is built in the structure of an aircraft.\r\n (Photo Credit: S.M.Bukhari's Photography)","category":"Resort","district":"Gilgit-Baltistan","latitude":"35.4275","longitude":"75.4567"},{"_key":"Shumber Waterfalls","Desc":"Shumber waterfall is 22 Kms and 45 minutes drive from Islamabad. First, you drive towards Murree Highway and turn left from Shah Dara Road before Bara Kahu and drive towards the Shahdara picnic spot. is half an hour hike from the Shahdara picnic spot.","category":"Waterfall","district":"Islamabad","latitude":"33.7773","longitude":"73.17057"},{"_key":"Skardu","Desc":"Far in Northern Pakistan, lies the Majestic Skardu Valley surrounded by mighty Karakorum, Himalaya, and Hindu Kush mountain ranges. Skardu, famous for climbing, mountaineering all around the world.","category":"Valley","district":"Gilgit-Baltistan","latitude":"35.3247","longitude":"75.551"},{"_key":"Sonmiani Beach","Desc":"Sonmiani Beach is a beach located in the Lasbela District of the Balochistan state of Pakistan. It is located in Sonmiani Bay. The beach is a two-hour drive from Karachi and is very popular among tourists. The beach is home to Portuguese Man of Wars, and various species of fish. \r\n ( Photo Credit: asif saeed | Flickr )","category":"Coastal","district":"Balochistan","latitude":"24.89951","longitude":"66.96973"},{"_key":"Taxila Museum","Desc":"Taxila Museum is located at Taxila, Punjab, Pakistan. The museum is home to a significant and comprehensive collection of Gandharan art dating from the 1st to the 7th centuries CE. Most objects in the collection were excavated from the ruins of ancient Taxila.","category":"Museum","district":"Punjab","latitude":"33.7459","longitude":"72.8187"},{"_key":"Thal Desert","Desc":"The Thal desert is situated in Punjab, Pakistan. The vast expanse is located between the Jhelum and Sindh rivers near the Pothohar Plateau, with a total length from north to south 190 miles, and a maximum breadth of 70 miles (110 km) and minimum breadth 20 miles. The desert covers the districts of Bhakkar, Khushab, Mianwali, Layyah, Muzaffargarh as well as Jhang, from the left bank of the river Jhelum. Geographically, it resembles the deserts of Cholistan and Thar.(Photo Credit: pakistan360degrees.com )","category":"Desert","district":"Punjab","latitude":"31.2281","longitude":"71.8099"},{"_key":"The Lahore Museum","Desc":"The Lahore Museum, is a museum located in Lahore, Pakistan. Founded in 1865 at a smaller location and opened in 1894 at its current location on 'The Mall' in Lahore during the British colonial period, Lahore Museum is one of Pakistan's most visited museums and one of the major museums in South Asia","category":"Museum","district":"Punjab","latitude":"31.5684","longitude":"74.3081"},{"_key":"Umbrella Waterfall Poona","Desc":"Umbrella Waterfall is 150 km from Islamabad and it takes 3 hours to get there. Umbrella waterfall is 481 km and 6 hours from Lahore.","category":"Waterfall","district":"Khyber Pakhtunkhwa","latitude":"33.97709","longitude":"73.48238"},{"_key":"West Bay Beach","Desc":"The West Bay Beach lies on the Makran coast, and is renowned for its diverse marine life and exquisite scenery. This is the semicircular bay covering one side of Gawdar beech.\r\n ( Photo Credit: Buzzpk )","category":"Coastal","district":"Balochistan","latitude":"25.1594","longitude":"62.1816"}]